<details>
<summary>Execution result of "run plan --all" in "."</summary>

```terraform
23:37:57.397 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./management-account/eu-west-1/s3
- Module ./management-account/global-infra/organization-accounts
- Module ./playground-account/eu-west-1/s3
- Module ./test-account/eu-west-1/s3


23:37:57.568 INFO   [playground-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./playground-account/eu-west-1/s3/.terragrunt-cache/Ife-siSQSkZudNuf1ioRzK__ydI/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:37:57.568 INFO   [management-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./management-account/eu-west-1/s3/.terragrunt-cache/6O7bSTWfYv7WPnJvTEak2cevHGQ/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:37:57.581 INFO   [test-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./test-account/eu-west-1/s3/.terragrunt-cache/FIgbXJVdUJAkmsa6YIf24Zbjalw/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:37:57.624 INFO   [management-account/global-infra/organization-accounts] Downloading Terraform configurations from ./modules/organization-account into ./management-account/global-infra/organization-accounts/.terragrunt-cache/3XLPvzLN2Hf8668drqHKYhDUbDk/Yycl6dC0BtLQ-XFNjTw2ySiFaUQ
23:37:57.993 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing the backend...
23:37:57.996 INFO   [management-account/eu-west-1/s3] terraform: Initializing the backend...
23:37:58.001 INFO   [playground-account/eu-west-1/s3] terraform: Initializing the backend...
23:37:58.006 INFO   [test-account/eu-west-1/s3] terraform: Initializing the backend...
23:37:58.878 INFO   [playground-account/eu-west-1/s3] terraform: 
23:37:58.878 INFO   [playground-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:37:58.879 INFO   [playground-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
23:37:58.884 INFO   [test-account/eu-west-1/s3] terraform: 
23:37:58.884 INFO   [test-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:37:58.884 INFO   [test-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
23:37:58.900 INFO   [management-account/eu-west-1/s3] terraform: 
23:37:58.900 INFO   [management-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:37:58.900 INFO   [management-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
23:37:58.929 INFO   [management-account/global-infra/organization-accounts] terraform: 
23:37:58.929 INFO   [management-account/global-infra/organization-accounts] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:37:58.929 INFO   [management-account/global-infra/organization-accounts] terraform: use this backend unless the backend configuration changes.
23:37:59.169 INFO   [test-account/eu-west-1/s3] terraform: Initializing provider plugins...
23:37:59.169 INFO   [test-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
23:37:59.181 INFO   [playground-account/eu-west-1/s3] terraform: Initializing provider plugins...
23:37:59.181 INFO   [playground-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
23:37:59.190 INFO   [management-account/eu-west-1/s3] terraform: Initializing provider plugins...
23:37:59.190 INFO   [management-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
23:37:59.220 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing provider plugins...
23:37:59.220 INFO   [management-account/global-infra/organization-accounts] terraform: - Finding latest version of hashicorp/aws...
23:37:59.372 INFO   [management-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
23:37:59.420 INFO   [test-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
23:37:59.557 INFO   [playground-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
23:37:59.624 INFO   [management-account/global-infra/organization-accounts] terraform: - Installing hashicorp/aws v6.0.0...
23:38:05.344 INFO   [management-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:38:05.344 INFO   [management-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:38:05.344 INFO   [management-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
23:38:05.344 INFO   [management-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
23:38:05.344 INFO   [management-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
23:38:05.345 INFO   [management-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
23:38:05.678 INFO   [test-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:38:05.678 INFO   [test-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:38:05.679 INFO   [test-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
23:38:05.680 INFO   [test-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
23:38:05.681 INFO   [test-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
23:38:05.681 INFO   [test-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
23:38:05.716 INFO   [playground-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:38:05.717 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:38:05.717 INFO   [playground-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
23:38:05.717 INFO   [playground-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
23:38:05.717 INFO   [playground-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
23:38:05.717 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
23:38:05.959 INFO   [management-account/global-infra/organization-accounts] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:38:05.959 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:38:05.959 INFO   [management-account/global-infra/organization-accounts] terraform: selections it made above. Include this file in your version control repository
23:38:05.959 INFO   [management-account/global-infra/organization-accounts] terraform: so that Terraform can guarantee to make the same selections by default when
23:38:05.959 INFO   [management-account/global-infra/organization-accounts] terraform: you run "terraform init" in the future.
23:38:05.959 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has been successfully initialized!
23:38:10.861 STDOUT [management-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt-main-account]
23:38:11.504 STDOUT [management-account/global-infra/organization-accounts] terraform: aws_organizations_account.this: Refreshing state... [id=929864627295]
23:38:11.612 STDOUT [test-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt-test-account]
23:38:11.654 STDOUT [playground-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt]
23:38:12.057 STDOUT [management-account/global-infra/organization-accounts] terraform: No changes. Your infrastructure matches the configuration.
23:38:12.057 STDOUT [management-account/global-infra/organization-accounts] terraform: Terraform has compared your real infrastructure against your configuration
23:38:12.057 STDOUT [management-account/global-infra/organization-accounts] terraform: and found no differences, so no changes are needed.
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform:   + create
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform:   - destroy
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this will be destroyed
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform:   # (because resource uses count or for_each)
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt-main-account" -> null
23:38:12.451 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt-main-account" -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt-main-account.s3.amazonaws.com" -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt-main-account.s3.eu-west-1.amazonaws.com" -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt-main-account" -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:       - tags                        = {
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
23:38:12.452 STDOUT [management-account/eu-west-1/s3] terraform:         } -> null
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:       - tags_all                    = {
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:         } -> null
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:       - grant {
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:           - id          = "fb3a504c2c3b80cce97fc2bdc3b54f23c6a053294b59038773062668af2c2a6f" -> null
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:           - permissions = [
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:             ] -> null
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:         }
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:           - rule {
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:                 }
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:             }
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:         }
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:       - versioning {
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:           - enabled    = false -> null
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:         }
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:     }
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-test-bucket-terragrunt-main-account"] will be created
23:38:12.453 STDOUT [management-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket                      = "ma-test-bucket-terragrunt-main-account"
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + force_destroy               = false
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + tags                        = {
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:         }
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + tags_all                    = {
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:         }
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
23:38:12.454 STDOUT [management-account/eu-west-1/s3] terraform:       + grant (known after apply)
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:       + logging (known after apply)
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:       + versioning (known after apply)
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:       + website (known after apply)
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:     }
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform: Plan: 1 to add, 0 to change, 1 to destroy.
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform: 
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform: Changes to Outputs:
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:   ~ bucket_id = "ma-test-bucket-terragrunt-main-account" -> {
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:       + ma-test-bucket-terragrunt-main-account = (known after apply)
23:38:12.455 STDOUT [management-account/eu-west-1/s3] terraform:     }
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform:   + create
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform:   - destroy
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this will be destroyed
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform:   # (because resource uses count or for_each)
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt-test-account" -> null
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt-test-account" -> null
23:38:13.261 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt-test-account.s3.amazonaws.com" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt-test-account.s3.eu-west-1.amazonaws.com" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt-test-account" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - tags                        = {
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag-test-account"
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:         } -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - tags_all                    = {
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag-test-account"
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:         } -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - grant {
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:           - id          = "52a4785162cb6f9cec841c46fb038426825896161cb6a9172f58b765693d29a4" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:           - permissions = [
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:             ] -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:         }
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:           - rule {
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
23:38:13.262 STDOUT [test-account/eu-west-1/s3] terraform:                 }
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:             }
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:         }
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       - versioning {
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:           - enabled    = false -> null
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:         }
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:     }
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-test-bucket-terragrunt-test-account"] will be created
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket                      = "ma-test-bucket-terragrunt-test-account"
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + force_destroy               = false
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + tags                        = {
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag-test-account"
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:         }
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + tags_all                    = {
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag-test-account"
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:         }
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
23:38:13.263 STDOUT [test-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + grant (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + logging (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + versioning (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + website (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:     }
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform: Plan: 1 to add, 0 to change, 1 to destroy.
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform: 
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform: Changes to Outputs:
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:   ~ bucket_id = "ma-test-bucket-terragrunt-test-account" -> {
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:       + ma-test-bucket-terragrunt-test-account = (known after apply)
23:38:13.264 STDOUT [test-account/eu-west-1/s3] terraform:     }
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform:   + create
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform:   - destroy
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this will be destroyed
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform:   # (because resource uses count or for_each)
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt" -> null
23:38:13.267 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt" -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt.s3.amazonaws.com" -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt.s3.eu-west-1.amazonaws.com" -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt" -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:       - tags                        = {
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
23:38:13.268 STDOUT [playground-account/eu-west-1/s3] terraform:         } -> null
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:       - tags_all                    = {
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:         } -> null
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:       - grant {
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:           - id          = "930454f06437e7fdb90b65c7ecea90969c129dcffb5f63020b02e1295aa3c04d" -> null
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:           - permissions = [
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:             ] -> null
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
23:38:13.269 STDOUT [playground-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:           - rule {
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:                 }
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:             }
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:       - versioning {
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:           - enabled    = false -> null
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:     }
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-bucket-one-altamash"] will be created
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
23:38:13.270 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "ma-bucket-one-altamash"
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
23:38:13.271 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:     }
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-bucket-two-altamash"] will be created
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "ma-bucket-two-altamash"
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:38:13.272 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:     }
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform: Plan: 2 to add, 0 to change, 1 to destroy.
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform: 
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform: Changes to Outputs:
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:   ~ bucket_id = "ma-test-bucket-terragrunt" -> {
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + ma-bucket-one-altamash = (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:       + ma-bucket-two-altamash = (known after apply)
23:38:13.273 STDOUT [playground-account/eu-west-1/s3] terraform:     }
```

</details>
    
